; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image1 - mode
	image3 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Star2 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument2 image1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 GroundStation5)
	(pointing satellite2 Planet9)
	(have_image Star7 image3)
	(have_image Phenomenon8 image1)
	(have_image Planet9 infrared2)
	(have_image Star10 image1)
	(have_image Star11 infrared2)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 infrared2)
))

)

; plan
1. (turn_to satellite2 star2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star2)
   goals met: 1 of 10
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 10
3. (calibrate satellite2 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 10
4. (turn_to satellite2 phenomenon8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 10
5. (turn_to satellite0 groundstation5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 10
6. (take_image satellite2 phenomenon8 instrument2 image1)
   added: (have_image phenomenon8 image1)
   goals met: 3 of 10
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 10
8. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 3 of 10
9. (turn_to satellite1 planet12 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet12)
   goals met: 2 of 10
10. (take_image satellite1 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 3 of 10
11. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 3 of 10
12. (take_image satellite1 planet13 instrument1 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 4 of 10
13. (turn_to satellite1 planet9 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet9)
   goals met: 4 of 10
14. (take_image satellite1 planet9 instrument1 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 5 of 10
15. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 5 of 10
16. (take_image satellite1 star11 instrument1 infrared2)
   added: (have_image star11 infrared2)
   goals met: 6 of 10
17. (turn_to satellite1 groundstation5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation5)
   goals met: 7 of 10
18. (turn_to satellite2 star10 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star10)
   goals met: 7 of 10
19. (take_image satellite2 star10 instrument2 image1)
   added: (have_image star10 image1)
   goals met: 8 of 10
20. (turn_to satellite2 star7 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star7)
   goals met: 8 of 10
21. (take_image satellite2 star7 instrument2 image3)
   added: (have_image star7 image3)
   goals met: 9 of 10
22. (turn_to satellite2 planet9 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet9)
   goals met: 10 of 10
